<br><br><center><h1 style="font-size:2em;color:#2467C0">Tagesaufgaben 06.04.2023</h1></center>
<br>

<div  class="alert alert-block alert-info">
1. Du hast zwei Dataframes mit Personendaten. Füge diese mittels concat zusammen und lasse dir den Inhalt ausgeben.

    Output:
       Alter    Stadt  Gewicht  Größe
    Name
    Anna      25   Berlin       60    170
    Ben       30  München       75    180
    Carla     22  Hamburg       55    165
    David     27     Köln       80    185

</div>

In [1]:
import pandas as pd

df1 = pd.DataFrame({'Alter': [25, 30, 22, 27],
                    'Stadt': ['Berlin', 'München', 'Hamburg', 'Köln']},
                    index=['Anna', 'Ben', 'Carla', 'David'])

df2 = pd.DataFrame({'Gewicht': [60, 75, 55, 80],
                    'Größe': [170, 180, 165, 185]},
                   index=['Anna', 'Ben', 'Carla', 'David'])

In [2]:
result = pd.concat([df1, df2], axis=1)
print(result)

       Alter    Stadt  Gewicht  Größe
Anna      25   Berlin       60    170
Ben       30  München       75    180
Carla     22  Hamburg       55    165
David     27     Köln       80    185

<div  class="alert alert-block alert-info">
2. Da ist noch ein drittes Dataframe dazugekommen, blöderweise stehen dort die Namen nicht im Index... Kannst du das ändern und mit concat auch das dritte Dataframe anhängen?

</div>

In [3]:
df3 = pd.DataFrame({"Name":['Anna', 'Ben', 'Carla', 'David'],
                    'Geschlecht': ["w", "m", "w", "m"],
                    'Augenfarbe': ["braun", "braun", "blau", "grün"]
})

In [4]:
result2 = pd.concat([result, df3.set_index("Name")], axis=1)
print(result2)

       Alter    Stadt  Gewicht  Größe Geschlecht Augenfarbe
Anna      25   Berlin       60    170          w      braun
Ben       30  München       75    180          m      braun
Carla     22  Hamburg       55    165          w       blau
David     27     Köln       80    185          m       grün

<div  class="alert alert-block alert-info">
3. Dir liegen zwei Dataframes mit Autodaten vor. Sie bilden eine fortlaufende Liste, weshalb du das erste unten an das zweite anhängen willst. Löse ebenfalls mit concat.

</div>

In [5]:
import pandas as pd

# DataFrame 1
df1 = pd.DataFrame({
    'Marke': ['Audi', 'BMW', 'Mercedes-Benz', 'Audi', 'BMW', 'Mercedes-Benz', 'Audi', 'BMW', 'Mercedes-Benz'],
    'Modell': ['A3', 'X7', 'GLC', 'A5', 'M2', 'E-Klasse', 'A1', 'M4', 'CLS'],
    'Baujahr': [2015, 2017, 2018, 2016, 2015, 2019, 2014, 2017, 2019],
    'Preis': [20000, 22000, 25000, 28000, 23000, 35000, 18000, 20000, 27000],
    'Kilometerstand': [20000, 35000, 28000, 40000, 25000, 18000, 22000, 29000, 21000]
})

# DataFrame 2
df2 = pd.DataFrame({
    'Marke': ['Volkswagen', 'Toyota', 'Mercedes-Benz', 'Audi', 'Volkswagen', 'Toyota', 'Mercedes-Benz', 'Audi', 'Volkswagen'],
    'Modell': ['Golf', 'Corolla', 'GLE', 'Q5', 'Tiguan', 'Camry', 'GLA', 'A3', 'Passat'],
    'Baujahr': [2016, 2018, 2019, 2017, 2015, 2017, 2020, 2018, 2016],
    'Preis': [18000, 19000, 28000, 31000, 15000, 17000, 40000, 22000, 19000],
    'Kilometerstand': [32000, 26000, 18000, 22000, 42000, 32000, 13000, 25000, 18000]
})

In [6]:
result = pd.concat([df1, df2], axis=0)
result

           Marke    Modell  Baujahr  Preis  Kilometerstand
0           Audi        A3     2015  20000           20000
1            BMW        X7     2017  22000           35000
2  Mercedes-Benz       GLC     2018  25000           28000
3           Audi        A5     2016  28000           40000
4            BMW        M2     2015  23000           25000
5  Mercedes-Benz  E-Klasse     2019  35000           18000
6           Audi        A1     2014  18000           22000
7            BMW        M4     2017  20000           29000
8  Mercedes-Benz       CLS     2019  27000           21000
0     Volkswagen      Golf     2016  18000           32000
1         Toyota   Corolla     2018  19000           26000
2  Mercedes-Benz       GLE     2019  28000           18000
3           Audi        Q5     2017  31000           22000
4     Volkswagen    Tiguan     2015  15000           42000
5         Toyota     Camry     2017  17000           32000
6  Mercedes-Benz       GLA     2020  40000           13000
7           Audi        A3     2018  22000           25000
8     Volkswagen    Passat     2016  19000           18000

<div  class="alert alert-block alert-info">
4. Jetzt hast du eine Liste mit Obst und eine mit Gemüse und willst diese wieder mit concat zusammenfügen. Allerdings gibt es eine knifflige Sache: Du möchtest, dass über dem Teil des Dataframes mit Obsteinträgen "Obst" steht und über dem mit Gemüseeinträgen "Gemüse". Wie stellst du das an? Dein Output sollte so aussehen:

    Output:
           Obst                      Gemüse
      ProduktID Produktname Preis ProduktID Produktname Preis
    0         1       Apfel   0.5         5     Paprika   0.8
    1         2      Banane   0.3         6       Gurke   0.6
    2         3    Erdbeere   1.2         7      Tomate   0.9
    3         4      Melone   2.5         8     Karotte   1.0


</div>

In [7]:
import pandas as pd

# DataFrame 1
df1 = pd.DataFrame({
    'ProduktID': [1, 2, 3, 4],
    'Produktname': ['Apfel', 'Banane', 'Erdbeere', 'Melone'],
    'Preis': [0.5, 0.3, 1.2, 2.5]
})

# DataFrame 2
df2 = pd.DataFrame({
    'ProduktID': [5, 6, 7, 8],
    'Produktname': ['Paprika', 'Gurke', 'Tomate', 'Karotte'],
    'Preis': [0.8, 0.6, 0.9, 1.0]
})

In [8]:
# Zusammenführen der DataFrames mit concat und Angabe von keys für die Spalten
df_concat = pd.concat([df1, df2], axis=1, keys=['Obst', 'Gemüse'])

# Ausgabe des Ergebnisses
print(df_concat)

       Obst                      Gemüse
  ProduktID Produktname Preis ProduktID Produktname Preis
0         1       Apfel   0.5         5     Paprika   0.8
1         2      Banane   0.3         6       Gurke   0.6
2         3    Erdbeere   1.2         7      Tomate   0.9
3         4      Melone   2.5         8     Karotte   1.0

<div  class="alert alert-block alert-info">
5. Du hast einen kleinen Auszug aus einer Videothek in Form von zwei Dataframes. Diese sollen zusammengefügt werden und dieses Mal mithilfe von merge.

    Output:

       ID          Titel         Regisseur  Bewertung  Anzahl Bewertungen
    0   1  Jurassic Park  Steven Spielberg        8.3                1000
    1   2  Indiana Jones  Steven Spielberg        7.6                2000
    2   3       Die Hard    John McTiernan        8.2                1500
    3   4   Forrest Gump   Robert Zemeckis        8.8                3000

</div>

In [9]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Titel': ['Jurassic Park', 'Indiana Jones', 'Die Hard', 'Forrest Gump'],
    'Regisseur': ['Steven Spielberg', 'Steven Spielberg', 'John McTiernan', 'Robert Zemeckis']
})

df2 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Bewertung': [8.3, 7.6, 8.2, 8.8],
    'Anzahl Bewertungen': [1000, 2000, 1500, 3000]
})

In [10]:
# Merge der DataFrames auf Basis der Spalte 'ID'
df_merged = pd.merge(df1, df2, on='ID')

# Ausgabe des Ergebnisses
print(df_merged)

   ID          Titel         Regisseur  Bewertung  Anzahl Bewertungen
0   1  Jurassic Park  Steven Spielberg        8.3                1000
1   2  Indiana Jones  Steven Spielberg        7.6                2000
2   3       Die Hard    John McTiernan        8.2                1500
3   4   Forrest Gump   Robert Zemeckis        8.8                3000

<div  class="alert alert-block alert-info">
6. Du hast Daten zu Personen vorliegen und sollst diese für deinen Chef zusammenführen. Da dein Chef sich nur für Zahlen interessiert, willst du ihm nur Daten zu Personen vorlegen, die auch bestellt haben. Löse mit merge.



</div>

In [25]:
df1 = pd.DataFrame({
    'Name': ['Max Mustermann', 'Petra Müller', 'Hans Schmidt', 'Lisa Meyer'],
    'Adresse': ['Hauptstraße 1', 'Bahnhofstraße 2', 'Mühlenweg 3', 'Bergstraße 4']
})

df2 = pd.DataFrame({
    'Name': ['Max Mustermann', 'Petra Müller', 'Hans Schmidt'],
    'Bestellnummer': [1234, 5678, 9101],
    'Betrag': [19.99, 29.99, 49.99]
})

In [12]:
# Inner Join der DataFrames auf Basis der Spalte 'Name'
df_merged = pd.merge(df1, df2, on='Name', how='inner')

# Ausgabe des Ergebnisses
print(df_merged)

             Name          Adresse  Bestellnummer  Betrag
0  Max Mustermann    Hauptstraße 1           1234   19.99
1    Petra Müller  Bahnhofstraße 2           5678   29.99
2    Hans Schmidt      Mühlenweg 3           9101   49.99

<div  class="alert alert-block alert-info">
7. Ups. Du hast deinem Chef die Liste vorgelegt und er fragt dich: Wo sind die Leute, die sich für den Newsletter registriert haben, aber dann nichts bestellt haben? Das wäre ja mal was Neues, wenn alle was bestellt hätten! Du gehst zurück ans Mergen, um ihm dann eine Liste mit allen Leuten vorzulegen...

    Output:
                 Name          Adresse  Bestellnummer  Betrag
    0  Max Mustermann    Hauptstraße 1         1234.0   19.99
    1    Petra Müller  Bahnhofstraße 2         5678.0   29.99
    2    Hans Schmidt      Mühlenweg 3         9101.0   49.99
    3      Lisa Meyer     Bergstraße 4            NaN     NaN

</div>

In [29]:
df1.merge(df2, left_on="Name", right_on="Name", how='left')

             Name          Adresse  Bestellnummer  Betrag
0  Max Mustermann    Hauptstraße 1         1234.0   19.99
1    Petra Müller  Bahnhofstraße 2         5678.0   29.99
2    Hans Schmidt      Mühlenweg 3         9101.0   49.99
3      Lisa Meyer     Bergstraße 4            NaN     NaN

In [23]:
# Inner Join der DataFrames auf Basis der Spalte 'Name'
df_merged = pd.merge(df1, df2, on='Name', how='left')

# Ausgabe des Ergebnisses
print(df_merged)

             Name          Adresse  Bestellnummer  Betrag
0  Max Mustermann    Hauptstraße 1         1234.0   19.99
1    Petra Müller  Bahnhofstraße 2         5678.0   29.99
2    Hans Schmidt      Mühlenweg 3         9101.0   49.99
3      Lisa Meyer     Bergstraße 4            NaN     NaN

<div  class="alert alert-block alert-info">
8. Du hast eine Liste mit Produkten (Index entspricht ihren IDs) und eine Liste mit Bestellungen. Du möchtest deine Bestellliste um Details zu den Produkten erweitern. Wie löst du das mit join?

    Output:
       order_id  quantity      product_name  price     brand
    1      1001         2        Messer-Set     50       WMF
    3      1002         1  Schneidebrett XL     20       WMF
    2      1003         4       Pfanne 24cm     30     Tefal
    4      1004         2    Besteck-Set 12     40  Zwilling

</div>

In [14]:
orders = pd.DataFrame({
    'order_id': [1001, 1002, 1003, 1004],
    'quantity': [2, 1, 4, 2]},
    index=[1, 3, 2, 4])

products = pd.DataFrame({
    'product_name': ['Messer-Set', 'Pfanne 24cm', 'Schneidebrett XL', 'Besteck-Set 12', 'Küchenwaage', 'Bratenthermometer'],
    'price': [50, 30, 20, 40, 15, 25],
    'brand': ['WMF', 'Tefal', 'WMF', 'Zwilling', 'Soehnle', 'WMF']},
    index=[1, 2, 3, 4, 5, 6])

# Left Join durchführen
merged = orders.join(products, how='left')

# Ergebnis ausgeben
print(merged)

   order_id  quantity      product_name  price     brand
1      1001         2        Messer-Set     50       WMF
3      1002         1  Schneidebrett XL     20       WMF
2      1003         4       Pfanne 24cm     30     Tefal
4      1004         2    Besteck-Set 12     40  Zwilling

<div  class="alert alert-block alert-info">
9. Du hast wieder mal zwei Dataframes, eins mit Personen, die den Newsletter deiner Firma abonniert haben, das andere mit Bestellungen. Die Indices entsprechen dabei den Personen-IDs. Du willst alle Leute haben, die sowohl den Newsletter abonniert haben, als auch etwas bestellt haben.

    Output:
       Name             Email  Newsletter    Product  Price
    1  John  john@example.com        True  Product A  10.99
    3  Mary  mary@example.com        True  Product C   8.99
    7   Bob   bob@example.com        True  Product E   9.99

</div>

In [15]:
newsletter = pd.DataFrame({
    'Name': ['John', 'Mary', 'Peter', 'Jane', 'Bob'],
    'Email': ['john@example.com', 'mary@example.com', 'peter@example.com', 'jane@example.com', 'bob@example.com'],
    'Newsletter': [True, True, True, False, True]},
    index=[1, 3, 4, 5, 7])

bestellungen = pd.DataFrame({
    'Product': ['Product A', 'Product B', 'Product C', 'Product D', 'Product E'],
    'Price': [10.99, 12.99, 8.99, 15.99, 9.99]},
    index=[1, 2, 3, 6, 7])

In [16]:
result = newsletter.join(bestellungen, how='inner')
print(result)

   Name             Email  Newsletter    Product  Price
1  John  john@example.com        True  Product A  10.99
3  Mary  mary@example.com        True  Product C   8.99
7   Bob   bob@example.com        True  Product E   9.99

<div  class="alert alert-block alert-info">
10. Aber leider sieht dein Chef das nicht so: Ich will alle sehen, brummt er unzufrieden. Ob Bestellung oder Newsletter, ist egal. Ich will einen Gesamtüberblick. Mich stören auch keine Leerstellen. Nun gut, du gehst zurück an deinen Arbeitsplatz, um das hier zu erhalten:

    Output:
        Name              Email Newsletter    Product  Price
    1   John   john@example.com       True  Product A  10.99
    2    NaN                NaN        NaN  Product B  12.99
    3   Mary   mary@example.com       True  Product C   8.99
    4  Peter  peter@example.com       True        NaN    NaN
    5   Jane   jane@example.com      False        NaN    NaN
    6    NaN                NaN        NaN  Product D  15.99
    7    Bob    bob@example.com       True  Product E   9.99

</div>

In [17]:
result = newsletter.join(bestellungen, how='outer')
print(result)

    Name              Email Newsletter    Product  Price
1   John   john@example.com       True  Product A  10.99
2    NaN                NaN        NaN  Product B  12.99
3   Mary   mary@example.com       True  Product C   8.99
4  Peter  peter@example.com       True        NaN    NaN
5   Jane   jane@example.com      False        NaN    NaN
6    NaN                NaN        NaN  Product D  15.99
7    Bob    bob@example.com       True  Product E   9.99

<div  class="alert alert-block alert-info">
11. Die Stimmungsschwankungen deines Chefs sind manchmal uneträglich. Was ist denn das für ein Quatsch, fragt er? Was interessieren mich die Leute, die nur den Newsletter abonniert haben? Leg mir mal alle vor, die was bestellt haben. Aber natürlich interessiert mich auch, wer davon einen Newsletter bestellt hat und wer nicht. Und dings - weil ich so sadistisch bin: Ich will, dass du in beide Richtungen joinst. Ich will bisschen was für mein Geld sehen. Du bist zwar etwas verstört, wozu du zweimal dasselbe machen sollst, aber der Blick auf die Uhr verrät: Bald ist Feierabend. Also begibst du dich in den letzten Kampf.

    Output:
       Product  Price  Name             Email Newsletter
    1  Product A  10.99  John  john@example.com       True
    2  Product B  12.99   NaN               NaN        NaN
    3  Product C   8.99  Mary  mary@example.com       True
    6  Product D  15.99   NaN               NaN        NaN
    7  Product E   9.99   Bob   bob@example.com       True

In [18]:
# Join Version 1
result = newsletter.join(bestellungen, how='right')
print(result)

   Name             Email Newsletter    Product  Price
1  John  john@example.com       True  Product A  10.99
2   NaN               NaN        NaN  Product B  12.99
3  Mary  mary@example.com       True  Product C   8.99
6   NaN               NaN        NaN  Product D  15.99
7   Bob   bob@example.com       True  Product E   9.99

In [19]:
result = bestellungen.join(newsletter, how='left')
print(result)

     Product  Price  Name             Email Newsletter
1  Product A  10.99  John  john@example.com       True
2  Product B  12.99   NaN               NaN        NaN
3  Product C   8.99  Mary  mary@example.com       True
6  Product D  15.99   NaN               NaN        NaN
7  Product E   9.99   Bob   bob@example.com       True

<div  class="alert alert-block alert-info">
12. Dein Chef möchte, dass du Informationen zu seinen Mitarbeitern, die in einem Dataframe vorliegen, in eine andere Form überführst. Verwende hierfür Stack und beseitige zuvor den numerischen Index, indem du die Namen als Index setzt. Außerdem soll über den Tätigkeiten in der Spalte "Tätigkeit" stehen.

    Output:
    Name                   Tätigkeit
    Anna     Montag          Meeting
             Dienstag    Buchhaltung
             Mittwoch      Marketing
    Bob      Montag      Buchhaltung
             Dienstag        Meeting
             Mittwoch    Entwicklung
    Charlie  Montag        Marketing
             Dienstag    Entwicklung
             Mittwoch        Meeting

In [8]:
df = pd.DataFrame({
    'Name': ['Anna', 'Bob', 'Charlie'],
    'Montag': ['Meeting', 'Buchhaltung', 'Marketing'],
    'Dienstag': ['Buchhaltung', 'Meeting', 'Entwicklung'],
    'Mittwoch': ['Marketing', 'Entwicklung', 'Meeting']
})
df

      Name       Montag     Dienstag     Mittwoch
0     Anna      Meeting  Buchhaltung    Marketing
1      Bob  Buchhaltung      Meeting  Entwicklung
2  Charlie    Marketing  Entwicklung      Meeting

In [9]:
df = df.set_index("Name")
df = df.stack()
df = df.rename(columns={"Tätigkeit"})
#df = df.rename("Tätigkeit")
df

TypeError: Series.rename() got an unexpected keyword argument 'columns'

<div  class="alert alert-block alert-info">
13. Das war die Verwaltung, aber es gibt auch einen Produktionsraum mit Maschinen (jede der Maschinen hat einen Kosenamen). Dein Chef möchte pro Zeile eine Maschine sehen und die verschiedenen Schichten als Spalten. Du bist echt müde, aber ein Blick auf die Uhr zeigt: Es ist gleich Feierabend. Tue deinem Chef noch diesen letzten Gefallen und dann kannst du endlich das Helle öffnen, das im Kühlschrank auf dich wartet.

In [16]:
df = pd.DataFrame({
    'Maschine': ['R-275 "Ernie"', 'R-275 "Ernie"', 'R-275 "Ernie"', 'PO-777 "Polina"', 'PO-777 "Polina"', 'PO-777 "Polina"', 'CH-823 "Che Guevara"', 'CH-823 "Che Guevara"', 'CH-823 "Che Guevara"', 'C-727 "Clara"', 'C-727 "Clara"', 'C-727 "Clara"', 'OT-14.2 "Otto"', 'OT-14.2 "Otto"', 'OT-14.2 "Otto"'],
    'Schicht': ['Früh', 'Spät', 'Nacht', 'Früh', 'Spät', 'Nacht', 'Früh', 'Spät', 'Nacht', 'Früh', 'Spät', 'Nacht', 'Früh', 'Spät', 'Nacht'],
    'Betriebszeit': [100, 150, 50, 200, 180, 220, 300, 320, 280, 150, 170, 130, 80, 120, 90]
})

df

                Maschine Schicht  Betriebszeit
0          R-275 "Ernie"    Früh           100
1          R-275 "Ernie"    Spät           150
2          R-275 "Ernie"   Nacht            50
3        PO-777 "Polina"    Früh           200
4        PO-777 "Polina"    Spät           180
5        PO-777 "Polina"   Nacht           220
6   CH-823 "Che Guevara"    Früh           300
7   CH-823 "Che Guevara"    Spät           320
8   CH-823 "Che Guevara"   Nacht           280
9          C-727 "Clara"    Früh           150
10         C-727 "Clara"    Spät           170
11         C-727 "Clara"   Nacht           130
12        OT-14.2 "Otto"    Früh            80
13        OT-14.2 "Otto"    Spät           120
14        OT-14.2 "Otto"   Nacht            90

In [14]:
df

                     Maschine  Betriebszeit
Schicht
Früh            R-275 "Ernie"           100
Spät            R-275 "Ernie"           150
Nacht           R-275 "Ernie"            50
Früh          PO-777 "Polina"           200
Spät          PO-777 "Polina"           180
Nacht         PO-777 "Polina"           220
Früh     CH-823 "Che Guevara"           300
Spät     CH-823 "Che Guevara"           320
Nacht    CH-823 "Che Guevara"           280
Früh            C-727 "Clara"           150
Spät            C-727 "Clara"           170
Nacht           C-727 "Clara"           130
Früh           OT-14.2 "Otto"            80
Spät           OT-14.2 "Otto"           120
Nacht          OT-14.2 "Otto"            90

In [11]:
df = df.set_index(["Maschine", "Schicht"])
df = df.unstack()
# df = df.reset_index() möglich, aber nicht notwendig.
df

                     Betriebszeit
Schicht                      Früh Nacht Spät
Maschine
C-727 "Clara"                 150   130  170
CH-823 "Che Guevara"          300   280  320
OT-14.2 "Otto"                 80    90  120
PO-777 "Polina"               200   220  180
R-275 "Ernie"                 100    50  150